Total Points for Lab 1: 100

Let's start by important the appropriate libraries.

In [21]:
import pandas as pd

In [22]:
import numpy as np

<font color='red'>To-do:</font> Insert a cell in markdown mode and write "This is a markdown example" in italics. [2.5 points]

### Initialization
You can create a Series by passing a list of values. By default, pandas will create an integer index.

In [23]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Let's create another Series

In [24]:
s2 = pd.Series(["1", "10", "3", "44"])

<font color='red'>To-do:</font> Insert a new cell above this one and create a new series, s3, with 5 random numbers between 0 and 10 [5 points]

<font color='red'>To-do:</font> If you aim to store integers, string is an inefficient data type. Let's convert this series s2 to the appropriate data type and store the result in s4. Display s4.  [5 points]

You can also use pandas to create an series of datetime objects. Let’s make one for the week beginning January 25th, 2015:

In [25]:
dates = pd.date_range('20150125',periods=7)
dates

DatetimeIndex(['2015-01-25', '2015-01-26', '2015-01-27', '2015-01-28',
               '2015-01-29', '2015-01-30', '2015-01-31'],
              dtype='datetime64[ns]', freq='D')

<font color='red'>To-do:</font> The date-range functionality can do more! Insert a new cell below this one and create a new dates2 DatetimeIndex object that starts at 4PM on September 1, 2022, that repeats weekly once 15 times. Display the result.  [5 points]

Now we’ll create a DataFrame using the dates array as our index, fill it with some random values using numpy, and give the columns some labels.

In [26]:
df = pd.DataFrame(np.random.randn(7,4), index=dates, columns=['col1','col2','col4','col3'])
df

                col1      col2      col4      col3
2015-01-25  0.651272  0.428320 -0.868076 -0.614319
2015-01-26  0.805486  0.867854 -0.377048  0.674784
2015-01-27  0.410639  1.460036  0.703635 -0.978173
2015-01-28  1.405285 -0.734022  0.088726 -1.428521
2015-01-29 -0.493102 -1.004334 -1.413189 -0.083245
2015-01-30 -0.110343  0.375084 -0.265511  1.570780
2015-01-31 -0.480415  0.295905 -1.053078  2.033925

<font color='red'>To-do:</font> Now create df2 that uses dates2 as its index. Use the same set of columns ('col1','col2','col4','col3'). [5 points]

It can also be useful to know how to create a DataFrame from a dict of objects. This comes in particularly handy when working with JSON-like structures.

In [27]:
df3 = pd.DataFrame({ 'A' : 1.,
                            'B' : pd.Timestamp('20130102'),
                            'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                            'D' : np.array([3] * 4,dtype='int32'),
                            'E' : pd.Categorical(["test","train","test","train"]),
                            'F' : 'foo' })
df3

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

<font color='red'>To-do:</font> Below we are trying to create another DataFrame df4. But there are some mistakes. Correct these mistakes to make sure the code compiles. [5 points]

In [28]:
df4 = pandas.DataFrame({ "c1" : 1,
                       "c2": {1.2, 0.5,3.1,"tree"},
                       "c3": {True, False,True}})

### Exploring data in a DataFrame
We can access the index of a dataframe as follows:

In [29]:
df.index

DatetimeIndex(['2015-01-25', '2015-01-26', '2015-01-27', '2015-01-28',
               '2015-01-29', '2015-01-30', '2015-01-31'],
              dtype='datetime64[ns]', freq='D')

<font color='red'>To-do:</font> Print out the datatypes of columns in df4. [5 points]

What do you see for c2? You can see that pandas tries to find a common object type. This is great but this flexibility can also result in runtime errors.  Make sure you are careful with the use of data types.

A few other basic operations:

In [30]:
df.values

array([[ 0.6512721 ,  0.42831982, -0.86807564, -0.61431862],
       [ 0.80548595,  0.86785363, -0.37704796,  0.67478376],
       [ 0.41063872,  1.46003626,  0.70363512, -0.9781726 ],
       [ 1.4052853 , -0.73402197,  0.0887256 , -1.42852053],
       [-0.49310193, -1.00433393, -1.41318926, -0.08324465],
       [-0.11034266,  0.37508433, -0.26551085,  1.57078002],
       [-0.48041534,  0.29590511, -1.05307788,  2.03392461]])

In [31]:
df.describe()

           col1      col2      col4      col3
count  7.000000  7.000000  7.000000  7.000000
mean   0.312689  0.241263 -0.454934  0.167890
std    0.709239  0.859903  0.721862  1.306652
min   -0.493102 -1.004334 -1.413189 -1.428521
25%   -0.295379 -0.219058 -0.960577 -0.796246
50%    0.410639  0.375084 -0.377048 -0.083245
75%    0.728379  0.648087 -0.088393  1.122782
max    1.405285  1.460036  0.703635  2.033925

<font color='red'>To-do:</font> Print the column names for df. [5 points]

<font color='red'>To-do:</font> Change the column names of df2 to A,B,C and D in order. [5 points]

### Some basic data transformations
DataFrames have a built-in transpose

In [32]:
df.T

,2015-01-25,2015-01-26,2015-01-27,2015-01-28,2015-01-29,2015-01-30,2015-01-31
col1,0.651272,0.805486,0.410639,1.405285,-0.493102,-0.110343,-0.480415
col2,0.428320,0.867854,1.460036,-0.734022,-1.004334,0.375084,0.295905
col4,-0.868076,-0.377048,0.703635,0.088726,-1.413189,-0.265511,-1.053078
col3,-0.614319,0.674784,-0.978173,-1.428521,-0.083245,1.570780,2.033925

We can also sort a DataFrame along a given data dimension. For example, we might want to sort by the values in the second column:

In [33]:
df.sort_values(by=['col2'])

                col1      col2      col4      col3
2015-01-29 -0.493102 -1.004334 -1.413189 -0.083245
2015-01-28  1.405285 -0.734022  0.088726 -1.428521
2015-01-31 -0.480415  0.295905 -1.053078  2.033925
2015-01-30 -0.110343  0.375084 -0.265511  1.570780
2015-01-25  0.651272  0.428320 -0.868076 -0.614319
2015-01-26  0.805486  0.867854 -0.377048  0.674784
2015-01-27  0.410639  1.460036  0.703635 -0.978173

We can also sort the rows (axis = 0) by their index values:

In [34]:
df.sort_index(axis=0, ascending=False)

                col1      col2      col4      col3
2015-01-31 -0.480415  0.295905 -1.053078  2.033925
2015-01-30 -0.110343  0.375084 -0.265511  1.570780
2015-01-29 -0.493102 -1.004334 -1.413189 -0.083245
2015-01-28  1.405285 -0.734022  0.088726 -1.428521
2015-01-27  0.410639  1.460036  0.703635 -0.978173
2015-01-26  0.805486  0.867854 -0.377048  0.674784
2015-01-25  0.651272  0.428320 -0.868076 -0.614319

<font color='red'>To-do:</font> Sort df according to column header values using df.sort_index. [5 points]

### Selection
To select only only the first few rows of a DataFrame, use the .head() function, or tail to get the last few rows. These functions by default return 5 rows but you can change that.

In [35]:
df.head()

                col1      col2      col4      col3
2015-01-25  0.651272  0.428320 -0.868076 -0.614319
2015-01-26  0.805486  0.867854 -0.377048  0.674784
2015-01-27  0.410639  1.460036  0.703635 -0.978173
2015-01-28  1.405285 -0.734022  0.088726 -1.428521
2015-01-29 -0.493102 -1.004334 -1.413189 -0.083245

<font color='red'>To-do:</font> Get the last 4 rows in df. [5 points]

Selecting a single column yields a Series, equivalent to df.col1:

In [36]:
df['col1']

2015-01-25    0.651272
2015-01-26    0.805486
2015-01-27    0.410639
2015-01-28    1.405285
2015-01-29   -0.493102
2015-01-30   -0.110343
2015-01-31   -0.480415
Freq: D, Name: col1, dtype: float64

We can also select a subset of the rows using slicing. You can select either by integer indexing or by value:

In [37]:
df[1:3]

                col1      col2      col4      col3
2015-01-26  0.805486  0.867854 -0.377048  0.674784
2015-01-27  0.410639  1.460036  0.703635 -0.978173

In [38]:
df['20150127':'20150130']

                col1      col2      col4      col3
2015-01-27  0.410639  1.460036  0.703635 -0.978173
2015-01-28  1.405285 -0.734022  0.088726 -1.428521
2015-01-29 -0.493102 -1.004334 -1.413189 -0.083245
2015-01-30 -0.110343  0.375084 -0.265511  1.570780

To select more than one column at a time, try .loc[]):

In [39]:
df.loc[:,['col2','col4']]

                col2      col4
2015-01-25  0.428320 -0.868076
2015-01-26  0.867854 -0.377048
2015-01-27  1.460036  0.703635
2015-01-28 -0.734022  0.088726
2015-01-29 -1.004334 -1.413189
2015-01-30  0.375084 -0.265511
2015-01-31  0.295905 -1.053078

You can select on rows and columns at the same time:

<font color='red'>To-do:</font> You can select on rows and columns at the same time. Select rows from '20150125' through '20150130' and columns col1 and col3. [5 points]

You can also use boolean indexing to select subset of a dataframe that satisfies a requirement

In [40]:
df[df['col1'] > 1]

                col1      col2      col4      col3
2015-01-28  1.405285 -0.734022  0.088726 -1.428521

<font color='red'>To-do:</font> Now select the rows where  col1  is greater than -0.5 or col4 is greater than 0. [5 points]

In [41]:
nonneg_only = df[df > 0]

In [42]:
nonneg_only

                col1      col2      col4      col3
2015-01-25  0.651272  0.428320       NaN       NaN
2015-01-26  0.805486  0.867854       NaN  0.674784
2015-01-27  0.410639  1.460036  0.703635       NaN
2015-01-28  1.405285       NaN  0.088726       NaN
2015-01-29       NaN       NaN       NaN       NaN
2015-01-30       NaN  0.375084       NaN  1.570780
2015-01-31       NaN  0.295905       NaN  2.033925

You can drop rows with missing values as such:

In [43]:
nonneg_only.dropna()

Empty DataFrame
Columns: [col1, col2, col4, col3]
Index: []

There were no rows with no missing values (most likely, these are random numbers after all...) and therefore the result is an empty dataframe. You can instead assign a default value (here, 0) to the NaN values

In [44]:
nonneg_only.fillna(value=0)

                col1      col2      col4      col3
2015-01-25  0.651272  0.428320  0.000000  0.000000
2015-01-26  0.805486  0.867854  0.000000  0.674784
2015-01-27  0.410639  1.460036  0.703635  0.000000
2015-01-28  1.405285  0.000000  0.088726  0.000000
2015-01-29  0.000000  0.000000  0.000000  0.000000
2015-01-30  0.000000  0.375084  0.000000  1.570780
2015-01-31  0.000000  0.295905  0.000000  2.033925

You can also do filtering using non-numeric values:

In [45]:
df_c = df.copy()
df_c['color'] = ['red', 'blue', 'red', 'red', 'blue', 'green', 'green' ]
df_c

                col1      col2      col4      col3  color
2015-01-25  0.651272  0.428320 -0.868076 -0.614319    red
2015-01-26  0.805486  0.867854 -0.377048  0.674784   blue
2015-01-27  0.410639  1.460036  0.703635 -0.978173    red
2015-01-28  1.405285 -0.734022  0.088726 -1.428521    red
2015-01-29 -0.493102 -1.004334 -1.413189 -0.083245   blue
2015-01-30 -0.110343  0.375084 -0.265511  1.570780  green
2015-01-31 -0.480415  0.295905 -1.053078  2.033925  green

In [46]:
df_c[df_c['color'].isin(['red','blue'])]

                col1      col2      col4      col3 color
2015-01-25  0.651272  0.428320 -0.868076 -0.614319   red
2015-01-26  0.805486  0.867854 -0.377048  0.674784  blue
2015-01-27  0.410639  1.460036  0.703635 -0.978173   red
2015-01-28  1.405285 -0.734022  0.088726 -1.428521   red
2015-01-29 -0.493102 -1.004334 -1.413189 -0.083245  blue

<font color='red'>To-do:</font> Now filter and display rows where color is not blue or green.  [5 points]

### Combining DataFrames
You can combine DataFrame objects using simple concatenation (provided they have the same columns):

In [47]:
frame_one = pd.DataFrame(np.random.randn(5, 4))
frame_one

          0         1         2         3
0  1.491475  0.117505  0.995056  1.045117
1 -1.635302  1.009618 -2.362367  2.717156
2  1.702053 -0.427757 -0.140284 -1.777578
3  0.700418 -0.963603  2.518095 -0.775454
4  1.302919 -0.802005 -0.977036  1.163799

In [48]:
frame_two = pd.DataFrame(np.random.randn(5, 4))
frame_two

          0         1         2         3
0 -1.577016  1.122691  0.845885 -0.118089
1  0.360310 -1.368153 -0.406703 -0.152324
2  0.432120 -0.202382 -0.954647 -0.986845
3 -0.383026 -0.086295 -2.207081  0.778256
4  0.505911 -0.352790  1.130169  1.490792

In [49]:
pd.concat([frame_one, frame_two])

          0         1         2         3
0  1.491475  0.117505  0.995056  1.045117
1 -1.635302  1.009618 -2.362367  2.717156
2  1.702053 -0.427757 -0.140284 -1.777578
3  0.700418 -0.963603  2.518095 -0.775454
4  1.302919 -0.802005 -0.977036  1.163799
0 -1.577016  1.122691  0.845885 -0.118089
1  0.360310 -1.368153 -0.406703 -0.152324
2  0.432120 -0.202382 -0.954647 -0.986845
3 -0.383026 -0.086295 -2.207081  0.778256
4  0.505911 -0.352790  1.130169  1.490792

<font color='red'>To-do:</font> Now concatenate along the other axis. [5 points]

<font color='red'>To-do:</font> Do you see an issue here? What do you think we need to do to avoid this problem? [5 points]

You can also perform SQL-like merge operations

In [51]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [52]:
right = pd.DataFrame({'key': ['foo', 'foo', 'bar'], 'rval': [3, 4, 5]}) 
right

   key  rval
0  foo     3
1  foo     4
2  bar     5

In [53]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     3
1  foo     1     4
2  bar     2     5

<font color='red'>To-do:</font> Now create two new dataframes, X and Y, with two matching columns, key1 and key2, anyway you prefer and merge them by matching on them  [5 points]

<font color='red'>To-do:</font> Notice that when you merge, if you had any rows on X and Y that didn't have a match, these are lost by default. Now merge X and Y to keep all rows (including the non-matching ones) of Y in the result    [5 points]

### Grouping
Sometimes you will want to group and summarize a DataFrame for a more efficient computation. This is one of the strengths of pandas and DataFrames.

In [54]:
foo_bar = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                                   'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                                   'C' : np.random.randn(8),
                                   'D' : np.random.randn(8)})
foo_bar

     A      B         C         D
0  foo    one  1.258678 -0.374913
1  bar    one -0.009197  0.587718
2  foo    two  1.053876 -0.497718
3  bar  three  1.561044 -0.209608
4  foo    two  0.076572  0.742788
5  bar    two -0.694221 -0.268375
6  foo    one -2.546170 -0.320750
7  foo  three  0.298160  2.232332

In [55]:
grouped = foo_bar.groupby('B').sum()
grouped

              C         D
B
one   -1.296690 -0.107945
three  1.859204  2.022724
two    0.436227 -0.023305

<font color='red'>To-do:</font> What happened to column A? Because sum operation cannot be applied to datatype string, the column was dropped here. Now use both columns to perform the operation for each possible B, A pair. Assign this to "grouped" and display it.  [5 points]

The .stack() function can be used to compress a level in the DataFrame’s columns:

In [56]:
stacked = grouped.stack()
stacked

B
one    C   -1.296690
       D   -0.107945
three  C    1.859204
       D    2.022724
two    C    0.436227
       D   -0.023305
dtype: float64

In [57]:
stacked.unstack()

              C         D
B
one   -1.296690 -0.107945
three  1.859204  2.022724
two    0.436227 -0.023305

## Reading from/Writing to files
You can write a dataframe to file as follows:

In [58]:
grouped.to_csv('grouped.csv')

<font color='red'>To-do:</font> Now write this same DataFrame to a JSON file. [2.5 points]

And you can read as follows:

In [59]:
new_frame = pd.read_csv('grouped.csv')

<font color='red'>To-do:</font> Now read the dataframe back but with columns renamed as W, X, Y and Z [5 points]

In [60]:
new_frame.head()

       B         C         D
0    one -1.296690 -0.107945
1  three  1.859204  2.022724
2    two  0.436227 -0.023305

Let's now work with a relatively more complex and bigger file

In [61]:
comics_df = pd.read_csv('comic_characters.csv')
comics_df

,id,publisher,name,Identity,align,eye,hair,sex,alive,appearances,first_appearance,month,year,date
0,1,Marvel,Spider-Man (Peter Parker),Secret Identity,Good Characters,Hazel Eyes,Brown Hair,Male Characters,Living Characters,4043.0,"1962, August",August,1962.0,8/1/1962
1,2,Marvel,Captain America (Steven Rogers),Public Identity,Good Characters,Blue Eyes,White Hair,Male Characters,Living Characters,3360.0,"1941, March",March,1941.0,3/1/1941
2,3,Marvel,"Wolverine (James \""Logan\"" Howlett)",Public Identity,Neutral Characters,Blue Eyes,Black Hair,Male Characters,Living Characters,3061.0,"1974, October",October,1974.0,10/1/1974
3,4,Marvel,"Iron Man (Anthony \""Tony\"" Stark)",Public Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,Living Characters,2961.0,"1963, March",March,1963.0,3/1/1963
4,5,Marvel,Thor (Thor Odinson),No Dual Identity,Good Characters,Blue Eyes,Blond Hair,Male Characters,Living Characters,2258.0,"1950, November",November,1950.0,11/1/1950
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23267,23268,DC,Nadine West (New Earth),Public Identity,Good Characters,NaN,NaN,Female Characters,Living Characters,NaN,NaN,1,NaN,NaN
23268,23269,DC,Warren Harding (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,Living Characters,NaN,NaN,1,NaN,NaN
23269,23270,DC,William Harrison (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,Living Characters,NaN,NaN,1,NaN,NaN
23270,23271,DC,William McKinley (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,Living Characters,NaN,NaN,1,NaN,NaN
23271,23272,DC,Mookie (New Earth),Public Identity,Bad Characters,Blue Eyes,Blond Hair,Male Characters,Living Characters,NaN,NaN,1,NaN,NaN

In [62]:
comic_df = pd.read_csv('comic_characters.csv',
parse_dates=['date'], dayfirst=False, index_col='id')
comic_df

,publisher,name,Identity,align,eye,hair,sex,alive,appearances,first_appearance,month,year,date
id,,,,,,,,,,,,,
1,Marvel,Spider-Man (Peter Parker),Secret Identity,Good Characters,Hazel Eyes,Brown Hair,Male Characters,Living Characters,4043.0,"1962, August",August,1962.0,1962-08-01
2,Marvel,Captain America (Steven Rogers),Public Identity,Good Characters,Blue Eyes,White Hair,Male Characters,Living Characters,3360.0,"1941, March",March,1941.0,1941-03-01
3,Marvel,"Wolverine (James \""Logan\"" Howlett)",Public Identity,Neutral Characters,Blue Eyes,Black Hair,Male Characters,Living Characters,3061.0,"1974, October",October,1974.0,1974-10-01
4,Marvel,"Iron Man (Anthony \""Tony\"" Stark)",Public Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,Living Characters,2961.0,"1963, March",March,1963.0,1963-03-01
5,Marvel,Thor (Thor Odinson),No Dual Identity,Good Characters,Blue Eyes,Blond Hair,Male Characters,Living Characters,2258.0,"1950, November",November,1950.0,1950-11-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...
23268,DC,Nadine West (New Earth),Public Identity,Good Characters,NaN,NaN,Female Characters,Living Characters,NaN,NaN,1,NaN,NaT
23269,DC,Warren Harding (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,Living Characters,NaN,NaN,1,NaN,NaT
23270,DC,William Harrison (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,Living Characters,NaN,NaN,1,NaN,NaT
23271,DC,William McKinley (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,Living Characters,NaN,NaN,1,NaN,NaT
23272,DC,Mookie (New Earth),Public Identity,Bad Characters,Blue Eyes,Blond Hair,Male Characters,Living Characters,NaN,NaN,1,NaN,NaT

The goal of this lab was to provide a high level introduction to pandas. There is so much more to it. You can/should practice more. A few other functions you might want to look into are: value_counts(), plot.hist(), pivot_table() and df.apply()... Note that we will use R for most of our analysis/visualization tasks but that doesn't mean you can't learn more about Python/pandas.